In [1]:
import numpy as np
import pandas as pd

In [3]:
students_performans = pd.read_csv('https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv')

In [4]:
students_performans.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
students_performans.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [6]:
students_performans.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [7]:
students_performans.shape

(1000, 8)

In [8]:
students_performans.groupby('gender').aggregate({'writing score': 'mean'})

        writing score
gender
female      72.467181
male        63.311203

In [9]:
students_performans.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [14]:
students_performans.iloc[0:5, 1:3]

  race/ethnicity parental level of education
0        group B           bachelor's degree
1        group C                some college
2        group B             master's degree
3        group A          associate's degree
4        group C                some college

In [16]:
students_performans.iloc[[1,3,5], [0, 5, -1]]

   gender  math score  writing score
1  female          69             88
3    male          47             44
5  female          71             78

In [19]:
students_performans.select_dtypes(include=[int], exclude=[object]).head(5)

   math score  reading score  writing score
0          72             72             74
1          69             90             88
2          90             95             93
3          47             57             44
4          76             78             75

In [20]:
students_performans.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [21]:
students_performans.index

RangeIndex(start=0, stop=1000, step=1)

In [22]:
students_performans.get_dtype_counts()

int64     3
object    5
dtype: int64

In [23]:
titanic = pd.read_csv('https://stepik.org/media/attachments/course/4852/titanic.csv')

In [24]:
titanic.shape

(891, 12)

In [25]:
titanic.get_dtype_counts()

float64    2
int64      5
object     5
dtype: int64

In [27]:
students_performans_with_names = students_performans.iloc[[1,3,5]]

In [28]:
students_performans_with_names.index = ["Liza", "Pavel", "Oleg"]

In [29]:
students_performans_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Liza,female,group C,some college,standard,completed,69,90,88
Pavel,male,group A,associate's degree,free/reduced,none,47,57,44
Oleg,female,group B,associate's degree,standard,none,71,83,78

In [30]:
students_performans_with_names.loc[['Liza'], ['gender']]

      gender
Liza  female

In [32]:
type(students_performans.iloc[:, 0])

pandas.core.series.Series

In [38]:
serie1 = pd.Series([1, 2, 3], index=['INDEX1', 'INDEX2', 'INDEX3'])
serie2 = pd.Series([4, 5, 6], index=['INDEX1', 'INDEX2', 'INDEX3'])

In [39]:
df = pd.DataFrame({'col_name_1': serie1, 'col_name_2': serie2})

In [40]:
df

        col_name_1  col_name_2
INDEX1           1           4
INDEX2           2           5
INDEX3           3           6

In [41]:
students_performans_with_names['gender']

Liza     female
Pavel      male
Oleg     female
Name: gender, dtype: object

In [42]:
students_performans_with_names[['gender']]

       gender
Liza   female
Pavel    male
Oleg   female